02_OF_cylinder/cylinderStart/constant/polyMesh/blockMeshDict_temp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

r	0.5;	// radius
r1	1;		// external radius

rm	#calc "-1.0*$r";
r1m	#calc "-1.0*$r1";



zM	0.5;	// max z

zm	#calc "-1.0*$zM";


xM	10;		// max x
xm	-2;		// min x

yM	2;		// max y
ym	#calc "-1*$yM";		// min y

angle	45.0;

radAngle    #calc "degToRad($angle)";
r_45        #calc "$r*sin($radAngle)";
r1_45       #calc "$r1*sin($radAngle)";

r_45m        #calc "-1.0*$r_45";
r1_45m       #calc "$r1_45";

// ARCS

a1 		#calc "degToRad(22.5)";
a3		#calc "$a1*3";
a5		#calc "$a1*5";
a7		#calc "$a1*7";
a9		#calc "$a1*9";
a11		#calc "$a1*11";
a13		#calc "$a1*13";
a15		#calc "$a1*15";

x_1        #calc "$r*cos($a1)";
x1_1       #calc "$r1*cos($a1)";
y_1        #calc "$r*sin($a1)";
y1_1       #calc "$r1*sin($a1)";

x_3        #calc "$r*cos($a3)";
x1_3       #calc "$r1*cos($a3)";
y_3        #calc "$r*sin($a3)";
y1_3       #calc "$r1*sin($a3)";

x_5        #calc "$r*cos($a5)";
x1_5       #calc "$r1*cos($a5)";
y_5        #calc "$r*sin($a5)";
y1_5       #calc "$r1*sin($a5)";

x_7        #calc "$r*cos($a7)";
x1_7       #calc "$r1*cos($a7)";
y_7        #calc "$r*sin($a7)";
y1_7       #calc "$r1*sin($a7)";

x_9        #calc "$r*cos($a9)";
x1_9       #calc "$r1*cos($a9)";
y_9        #calc "$r*sin($a9)";
y1_9       #calc "$r1*sin($a9)";

x_11        #calc "$r*cos($a11)";
x1_11       #calc "$r1*cos($a11)";
y_11        #calc "$r*sin($a11)";
y1_11       #calc "$r1*sin($a11)";

x_13        #calc "$r*cos($a13)";
x1_13       #calc "$r1*cos($a13)";
y_13        #calc "$r*sin($a13)";
y1_13       #calc "$r1*sin($a13)";

x_15        #calc "$r*cos($a15)";
x1_15       #calc "$r1*cos($a15)";
y_15        #calc "$r*sin($a15)";
y1_15       #calc "$r1*sin($a15)";




vertices
(
    ($r 0 $zm)			// 0
    ($r1 0 $zm)			// 1
    ($xM 0 $zm)			// 2
    ($xM $r1_45 $zm)	// 3
    ($r1_45 $r1_45 $zm)	// 4
    ($r_45 $r_45 $zm)	// 5
    ($xM $yM $zm)		// 6
    ($r1_45 $yM $zm)	// 7
    (0 $yM $zm)			// 8
    (0 $r1 $zm)			// 9
    (0 $r $zm)			// 10
    ($rm 0 $zm)			// 11
    ($r1m 0 $zm)		// 12
    ($xm 0 $zm)			// 13
    ($xm $r1_45 $zm)	// 14
    ($r1_45m $r1_45 $zm)	// 15
    ($r_45m $r_45 $zm)	// 16
    ($xm $yM $zm)		// 17
    ($r1_45m $yM $zm)	// 18
    
    ($r 0 $zM)			// 19
    ($r1 0 $zM)			// 20
    ($xM 0 $zM)			// 21
    ($xM $r1_45 $zM)	// 22
    ($r1_45 $r1_45 $zM)	// 23
    ($r_45 $r_45 $zM)	// 24
    ($xM $yM $zM)		// 25
    ($r1_45 $yM $zM)	// 26
    (0 $yM $zM)			// 27
    (0 $r1 $zM)			// 28
    (0 $r $zM)			// 29
    ($rm 0 $zM)			// 30
    ($r1m 0 $zM)		// 31
    ($xm 0 $zM)			// 32
    ($xm $r1_45 $zM)	// 33
    ($r1_45m $r1_45 $zM)	// 34
    ($r_45m $r_45 $zM)	// 35
    ($xm $yM $zM)		// 36
    ($r1_45m $yM $zM)	// 37
    
    ($xM $r1_45m $zm)	// 38
    ($r1_45 $r1_45m $zm)	// 39
    ($r_45 $r_45m $zm)	// 40
    ($xM $ym $zm)		// 41
    ($r1_45 $ym $zm)	// 42
    (0 $ym $zm)			// 43
    (0 $r1m $zm)		// 44
    (0 $rm $zm)			// 45
    ($xm $r1_45m $zm)	// 46
    ($r1_45m $r1_45m $zm)	// 47
    ($r_45m $r_45m $zm)	// 48
    ($xm $ym $zm)		// 49
    ($r1_45m $ym $zm)	// 50
    
    ($xM $r1_45m $zM)	// 51
    ($r1_45 $r1_45m $zM)	// 52
    ($r_45 $r_45m $zM)	// 53
    ($xM $ym $zM)		// 54
    ($r1_45 $ym $zM)	// 55
    (0 $ym $zM)			// 56
    (0 $r1m $zM)		// 57
    (0 $rm $zM)			// 58
    ($xm $r1_45m $zM)	// 59
    ($r1_45m $r1_45m $zM)	// 60
    ($r_45m $r_45m $zM)	// 61
    ($xm $ym $zM)		// 62
    ($r1_45m $ym $zM)	// 63
    
);

blocks
(
    hex (5 4 9 10 24 23 28 29) (80 20 1) simpleGrading (10 1 1)
    hex (0 1 4 5 19 20 23 24) (80 20 1) simpleGrading (10 1 1)
    hex (1 2 3 4 20 21 22 23) (200 20 1) simpleGrading (1 1 1)
    hex (4 3 6 7 23 22 25 26) (200 40 1) simpleGrading (1 1 1)
    hex (9 4 7 8 28 23 26 27) (20 40 1) simpleGrading (1 1 1)
    hex (16 10 9 15 35 29 28 34) (20 80 1) simpleGrading (1 10 1)
    hex (11 16 15 12 30 35 34 31) (20 80 1) simpleGrading (1 10 1)
    hex (12 15 14 13 31 34 33 32) (20 20 1) simpleGrading (1 1 1)
    hex (15 18 17 14 34 37 36 33) (40 20 1) simpleGrading (1 1 1)
    hex (9 8 18 15 28 27 37 34) (40 20 1) simpleGrading (1 1 1)
    
    hex (40 45 44 39 53 58 57 52) (20 80 1) simpleGrading (1 10 1)
    hex (0 40 39 1 19 53 52 20) (20 80 1) simpleGrading (1 10 1)
    hex (1 39 38 2 20 52 51 21) (20 200 1) simpleGrading (1 1 1)
    hex (39 42 41 38 52 55 54 51) (40 200 1) simpleGrading (1 1 1)
    hex (44 43 42 39 57 56 55 52) (40 20 1) simpleGrading (1 1 1)
    hex (48 47 44 45 61 60 57 58) (80 20 1) simpleGrading (10 1 1)
    hex (11 12 47 48 30 31 60 61) (80 20 1) simpleGrading (10 1 1)
    hex (12 13 46 47 31 32 59 60) (20 20 1) simpleGrading (1 1 1)
    hex (47 46 49 50 60 59 62 63) (20 40 1) simpleGrading (1 1 1)
    hex (44 47 50 43 57 60 63 56) (20 40 1) simpleGrading (1 1 1)
);

edges
(
	arc 0 5 ($x_1 $y_1 $zm)
	arc 5 10 ($x_3 $y_3 $zm)
	arc 1 4 ($x1_1 $y1_1 $zm)
	arc 4 9 ($x1_3 $y1_3 $zm)
	arc 19 24 ($x_1 $y_1 $zM)
	arc 24 29 ($x_3 $y_3 $zM)
	arc 20 23 ($x1_1 $y1_1 $zM)
	arc 23 28 ($x1_3 $y1_3 $zM)
	arc 11 16 ($x_7 $y_7 $zm)
	arc 16 10 ($x_5 $y_5 $zm)
	arc 12 15 ($x1_7 $y_7 $zm)
	arc 15 9 ($x1_5 $y1_5 $zm)
	arc 30 35 ($x_7 $y_7 $zM)
	arc 35 29 ($x_5 $y_5 $zM)
	arc 31 34 ($x1_7 $y1_7 $zM)
	arc 34 28 ($x1_5 $y1_5 $zM)

	arc 0 40 ($x_15 $y_15 $zm)
	arc 40 45 ($x_13 $y_13 $zm)
	arc 1 39 ($x1_15 $y1_15 $zm)
	arc 39 44 ($x1_13 $y1_13 $zm)
	arc 19 53 ($x_15 $y_15 $zM)
	arc 53 58 ($x_13 $y_13 $zM)
	arc 20 52 ($x1_15 $y1_15 $zM)
	arc 52 57 ($x1_13 $y1_13 $zM)
	arc 11 48 ($x_9 $y_9 $zm)
	arc 48 45 ($x_11 $y_11 $zm)
	arc 12 47 ($x1_9 $y1_9 $zm)
	arc 47 44 ($x1_11 $y1_11 $zm)
	arc 30 61 ($x_9 $y_9 $zM)
	arc 61 58 ($x_11 $y_11 $zM)
	arc 31 60 ($x1_9 $y1_9 $zM)
	arc 60 57 ($x1_11 $y1_11 $zM)
);

boundary
(
    top
    {
        type symmetryPlane;
        faces
        (
            (7 8 27 26)
            (6 7 26 25)
            (8 18 37 27)
            (18 17 36 37)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (49 50 63 62)
            (50 43 56 63)
            (43 42 55 56)
            (42 41 54 55)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (14 13 32 33)
            (17 14 33 36)
            
            (46 13 32 59)
            (46 49 62 59)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 3 22 21)
            (3 6 25 22)
            
            (38 51 21 2)
            (41 54 51 38)
        );
    }
    
    cylinder
    {
    	type wall;
    	faces
    	(
    		(10 5 24 29)
    		(5 0 19 24)
    		(16 10 29 35)
    		(11 16 35 30)
    		
    		(48 11 30 61)
    		(45 48 61 58)
    		(40 45 58 53)
    		(0 40 53 19)
    	)
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (5 10 9 4)
            (24 23 28 29)
            (0 5 4 1)
            (19 20 23 24)
            (1 4 3 2)
            (20 21 22 23)
            (4 7 6 3)
            (23 22 25 26)
            (4 9 8 7)
            (28 23 26 27)
            (16 15 9 10)
            (35 29 28 34)
            (12 15 16 11)
            (31 30 35 34)
            (13 14 15 12)
            (32 31 34 33)
            (14 17 18 15)
            (33 34 37 36)
            (15 18 8 9)
            (34 28 27 37)
            (45 40 39 44)
            (58 57 52 53)
            (40 0 1 39)
            (53 52 20 19)
            (39 1 2 38)
            (52 51 21 20)
            (39 38 41 42)
            (52 55 54 51)
            (44 39 42 43)
            (57 56 55 52)
            (47 48 45 44)
            (60 57 58 61)
            (12 11 48 47)
            (31 60 61 30)
            (13 12 47 46)
            (32 59 60 31)
            (49 46 47 50)
            (62 63 60 59)
            (50 47 44 43)
            (63 56 57 60)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //

