02_OF_cylinder/cylinderStart/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          245;
        startFace       61555;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          245;
        startFace       61800;
    }
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       62045;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       62165;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       62285;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          62000;
        startFace       62445;
    }
)

// ************************************************************************* //
